leetcode_2454_next_greater_element_iv.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Leetcode: 2454. Next Greater Element IV</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="style.css">

</head>
<body>
<!--  --><nav><span class="nav-header">Problem Solving</span><span class="nav-items"><a href="index.html">Home</a><span></nav><div id="content" class="content">
<h1 class="title">Leetcode: 2454. Next Greater Element IV</h1>

<div id="outline-container-org57eda2b" class="outline-2">
<h2 id="org57eda2b">Understand the problem</h2>
<div class="outline-text-2" id="text-org57eda2b">
<p>
Given an array of non-negative integers, find for each integer in the array the second greatest element to its right.
</p>
</div>

<div id="outline-container-org3e50c11" class="outline-3">
<h3 id="org3e50c11">Useful prompts</h3>
<div class="outline-text-3" id="text-org3e50c11">
<ul class="org-ul">
<li><a href="can_you_derive_an_invariant_based_on_the_smallest_possible_examples.html#ID-BA632D61-93B6-47AB-B11A-7E9EBE3FC71D">Can we derive an invariant based on the smallest possible examples?</a></li>
<li><a href="have_you_solved_a_similar_problem.html#ID-50666722-6010-4D80-8283-6DE83E32EB33">Have you solved a similar problem?</a> <a href="monotonic_stack.html#ID-E4C9A18D-FC2B-4C1D-A040-1A94C39F9F63">Problem: Next greater integer in unsorted array</a>.</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org802e1a7" class="outline-2">
<h2 id="org802e1a7">Derive a plan</h2>
<div class="outline-text-2" id="text-org802e1a7">
<p>
Let's keep two sorted containers \(a\) and \(b\).  Elements on \(a\) didn't see a greater element to the left, and elements on \(b\) saw one element greater than them to their left.  For each element \(i\) in the array (left to right), we remove from \(b\) all elements that are smaller than \(i\) since \(i\) is the second greatest element to their left; after that we transfer elements from \(a\) to \(b\) that are smaller than \(i\).  Finally, we add \(i\) to \(a\) and continue the process.  Time complexity is \(O(n \log n)\) and space is \(O(n)\).
</p>
</div>

<div id="outline-container-orgf8a7726" class="outline-3">
<h3 id="orgf8a7726">Carry out the plan</h3>
<div class="outline-text-3" id="text-orgf8a7726">
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold;">from</span> sortedcontainers <span style="font-weight: bold;">import</span> SortedList


<span style="font-weight: bold;">class</span> <span style="font-weight: bold; text-decoration: underline;">Solution</span>:
    <span style="font-weight: bold;">def</span> <span style="font-weight: bold;">secondGreaterElement</span>(<span style="font-weight: bold;">self</span>, nums: List[<span style="font-weight: bold;">int</span>]) -&gt; <span style="font-weight: bold; font-style: italic;">List</span>[<span style="font-weight: bold;">int</span>]:
        N = <span style="font-weight: bold;">len</span>(nums)
        <span style="font-weight: bold; font-style: italic;">a</span> = SortedList([], key=<span style="font-weight: bold;">lambda</span> i: nums[i])
        b = SortedList([], key=<span style="font-weight: bold;">lambda</span> i: nums[i])
        ans = [-1] * N
        a.add(0)
        <span style="font-weight: bold;">for</span> i <span style="font-weight: bold;">in</span> <span style="font-weight: bold;">range</span>(1, N):
            <span style="font-weight: bold;">while</span> b <span style="font-weight: bold;">and</span> nums[b[0]] &lt; nums[i]:
                ans[b.pop(0)] = nums[i]

            <span style="font-weight: bold;">while</span> a <span style="font-weight: bold;">and</span> nums[a[0]] &lt; nums[i]:
                b.add(a.pop(0))

            a.add(i)

        <span style="font-weight: bold;">return</span> ans
</pre>
</div>
</div>
</div>
</div>
</div>
</body>
</html>